---
kind: method
id: M:Autodesk.Revit.DB.ProjectLocationSet.Contains(Autodesk.Revit.DB.ProjectLocation)
source: html/007b3a3e-e714-28a1-d019-a8fef1757a7b.htm
---
# Autodesk.Revit.DB.ProjectLocationSet.Contains Method

Tests for the existence of a project location within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	ProjectLocation item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.ProjectLocation`) - The project location to be searched for.

## Returns
The Contains method returns True if the project location is within the set, otherwise False.